namespace Practice_52;

public class PatientsFactory
{
    public List<Patient> Create()
    {
        return new List<Patient>
        {
            new Patient("Тимофей", "Гаврилов", "Дмитриевич", 27, "Простуда"),
            new Patient("Арсений", "Николаев", "Алексеевич", 30, "Дока2"),
            new Patient("Всеволод", "Тарасов", "Андреевич", 31, "Простуда"),
            new Patient("Михаил", "Артемов", "Тимофеевич", 28, "Дока2"),
            new Patient("Максим", "Кузнецов", "Львович", 29, "Простуда"),
            new Patient("Марк", "Матвеев", "Андреевич", 26, "Дока2"),
            new Patient("Иван", "Андреев", "Олегович", 32, "Простуда"),
            new Patient("Роберт", "Куликов", "Артёмович", 35, "Дока2"),
            new Patient("Андрей", "Мартынов", "Владиславович", 30, "Простуда"),
            new Patient("Матвей", "Левин", "Никитич", 29, "Дока2"),
        };
    }
}